export const mealMenus = {
  "Меню 1": {
    "Закуска": ["High Protein Pudding Milbona - 1 бр + банан - 100 г", "Протеин на прах - 1 доза + банан - 100 г + прясно мляко 1.5% - 100 г", "Skyr обезмаслен - 175 г + ябълка - 150 г + фъстъчено масло - 10 г"],
    "След тренировка": ["Пилешка пържола от бут без кожа - 210 г + салата + протеинов хляб Vita - 40 г", "Пъстърва печена - 210 г + салата + картофи - 70 г", "3 яйца + 4 белтъка + пуешко филе - 85 г + протеинов хляб - 50 г", "Свинско контра филе - 190 г + салата + картофи - 90 г", "Моцарела light - 125 г + домат - 300 г + пуешко филе - 110 г + протеинов хляб - 50 г + песто - 10 г"],
    "Следобедна закуска": ["Протеин на прах - 1 доза + кисело мляко 2% - 400 г + ябълка - 100 г + овесени ядки - 45 г", "Цезар салата: пилешки гърди - 130 г + салата + Caesar сос - 20 г + крутони - 40 г", "Skyr - 350 г + Corny Big - 1 бр + ябълка - 50 г + бадеми - 15 г"],
    "Вечеря": ["Свински врат печен - 150 г + салата", "3 яйца + 2 белтъка + сирене - 40 г + пуешко филе - 40 г + салата", "Пилешка пържола от бут - 160 г + салата + Caesar сос - 30 г", "Свинско контра филе - 110 г + салата + бадеми - 30 г", "Сьомга печена - 150 г + салата + зехтин - 6 г"],
    "Преди лягане": ["High Protein Quark-Creme - 1 бр"]
  },
  "Меню 2": {
    "Закуска": ["Протеинов хляб Vita - 60 г + пушено пуешко филе - 50 г + кашкавал - 35 г + домат - 150 г", "High Protein Quark-Creme - 1 бр + бадеми - 25 г + ябълка - 80 г", "Протеин - 1 доза + мляко 1.5% - 200 г + фъстъчено масло - 15 г + ябълка - 100 г"],
    "След тренировка": ["Лаваш - 50 г + крема сирене Goldessa - 50 г + пилешка пържола от бут - 220 г + салата", "Ориз - 50 г + пилешка пържола от бут - 210 г + зеленчуци - 50 г + кашкавал - 40 г", "Макарони - 50 г + Maggi Carbonara - 1/2 пакет + кашкавал - 40 г + пилешка пържола - 200 г", "3 яйца + 3 белтъка + пуешко филе - 75 г + кашкавал - 45 г + протеинов хляб - 40 г + картофи - 90 г", "Пъстърва - 220 г + картофи - 160 г + зехтин - 10 г + салата"],
    "Следобедна закуска": ["Ябълка - 110 г + High Protein Quark-Creme - 1 бр + бадеми - 25 г", "LZ шоколад - 1 бр + извара Pilos - 250 г", "Протеин - 1 доза + мляко - 200 г + фъстъчено масло - 15 г + ябълка - 130 г"],
    "Вечеря": ["Пилешка пържола от бут - 160 г + салата", "2 яйца + 3 белтъка + пуешко филе - 60 г + сирене - 15 г + салата", "Свинско контра филе - 140 г + салата", "Моцарела light - 125 г + домат - 200 г + пуешко филе - 70 г + ябълка - 80 г", "Пъстърва - 150 г + салата"],
    "Преди лягане": ["High Protein Quark-Creme - 1 бр"]
  },
  "Меню 3": {
    "Закуска": ["High Protein Quark-Creme - 1 бр + бадеми - 30 г + ябълка - 130 г", "Протеин - 1 доза + мляко 1.5% - 200 г + фъстъчено масло - 18 г + банан - 100 г"],
    "След тренировка": ["Бургер питка - 1 бр + пилешки гърди - 160 г + Goldessa - 45 г + домат - 200 г", "Ориз - 50 г + пилешка пържола от бут - 170 г + зеленчуци - 50 г + кашкавал - 15 г", "Пилешки гърди - 180 г + картофи - 100 г + зехтин - 10 г + салата", "3 яйца + 3 белтъка + сирене - 15 г + пуешко филе - 60 г + пълнозърнест хляб - 50 г + салата", "Пъстърва - 150 г + картофи - 170 г + зехтин - 5 г + салата"],
    "Следобедна закуска": ["Skyr - 350 г + бадеми - 20 г + ябълка - 100 г", "Шейк: мляко 1.5% - 300 г + протеин - 1.5 дози + банан - 60 г + фъстъчено масло - 10 г"],
    "Вечеря": ["3 яйца + 3 белтъка + пуешко филе - 50 г + кашкавал - 20 г + салата", "Свинско контра филе - 160 г + салата + зехтин - 5 г", "Пилешка пържола от бут - 180 г + салата + зехтин - 5 г", "Пъстърва - 160 г + салата + зехтин - 6 г", "Моцарела light - 125 г + домат - 300 г + пуешко филе - 80 г + песто - 17 г"],
    "Преди лягане": ["High Protein Quark-Creme - 1 бр"]
  }
} as const;

export type MenuName = keyof typeof mealMenus;
export const mealNames = Object.keys(mealMenus["Меню 1"]);
